testTutorials/hysteresis/inclinedPlate/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

# Preprocessing
rm -rf 0 && cp -r 0.org 0 
rm -rf 0/*.template
rm -rf constant/*.template
rm -rf system/*.template

runApplication blockMesh
runApplication checkMesh

# Initialization
runApplication surfaceInitVolumeFraction

# Postprocessing

runApplication decomposePar
#------------------------------------------------------------------------------

